Project/Toir/src/Documents/торо_УчетНаработкиОборудования/торо_УчетНаработкиОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_УчетНаработкиОборудования</name>
  <basedOn>Document.торо_ВыявленныеДефекты</basedOn>
  <basedOn>Document.торо_АктОВыполненииЭтапаРабот</basedOn>
  <basedOn>Document.торо_АктОВыполненииРегламентногоМероприятия</basedOn>
  <registerRecords>AccumulationRegister.торо_НаработкаОбъектовРемонта</registerRecords>
  <registerRecords>InformationRegister.торо_ПериодыНаработкиОР</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СбросНаработки</name>
    <type>
      <types>DocumentRef.торо_УстановкаПроизвольногоЗначенияНаработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзМобильного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
      <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НаработкаОбъектов</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПараметрыВыработкиОС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРаботыС</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРаботыПо</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СтароеЗначение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НовоеЗначение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаработкаСНачалаЭксплуатации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаработкаСНачалаЭксплуатацииНачало</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Иерархия</name>
      <comment>Предназначен для определения иерархии для структуры которой будет распространятся наработка.</comment>
      <type>
        <types>CatalogRef.торо_СтруктурыОР</types>
      </type>
    </attributes>
    <attributes>
      <name>РаспространятьНаПодчиненных</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаработкаПодчиненныхОбъектов</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПараметрыВыработкиОС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРаботыС</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРаботыПо</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СтароеЗначение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НовоеЗначение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаработкаСНачалаЭксплуатации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаработкаСНачалаЭксплуатацииНачало</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РодительИерархии</name>
      <comment>Предназначен для определения иерархии для структуры которой будет распространятся наработка.</comment>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/Documents/торо_УчетНаработкиОборудования/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции
# Область Печать

// Заполняет список команд печати.
//
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Заявка на ремонт
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_УчетНаработкиОборудования";
	КомандаПечати.Идентификатор = "УчетПараметровНаработки";
	КомандаПечати.Представление = НСтр("es='El recuento de la elaboración de la maquinaria';ru='Учет наработки оборудования';en='Accounting for equipment operating time'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
КонецПроцедуры

// Сформировать печатные формы объектов.
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую.
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УчетПараметровНаработки");
	Если НужноПечататьМакет Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"УчетПараметровНаработки",
		НСтр("es='El recuento de la elaboración de la maquinaria';ru='Учет наработки оборудования';en='Accounting for equipment operating time'"),
		ПечатьУчетПараметровНаработки(МассивОбъектов, ПараметрыПечати),
		,
		"Документ.торо_УчетНаработкиОборудования.ПФ_MXL_УчетПараметровНаработки");
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьУчетПараметровНаработки(МассивОбъектов, ПараметрыПечати)

	ТабДок = Новый ТабличныйДокумент;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_УчетНаработкиОборудования.ПФ_MXL_УчетПараметровНаработки");
	
		ЗапросШапки = Новый Запрос;
	ЗапросШапки.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_УчетНаработкиОборудования.Ссылка КАК Ссылка,
	|	торо_УчетНаработкиОборудования.Номер КАК Номер,
	|	торо_УчетНаработкиОборудования.Дата КАК Дата,
	|	торо_УчетНаработкиОборудования.Организация КАК Организация,
	|	торо_УчетНаработкиОборудования.Подразделение КАК Подразделение,
	|	торо_УчетНаработкиОборудования.Ответственный КАК Ответственный,
	|	торо_УчетНаработкиОборудования.Комментарий КАК Комментарий,
	|	торо_УчетНаработкиОборудования.НаработкаОбъектов.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Объект КАК Объект,
	|		Показатель КАК Показатель,
	|		ДатаРаботыС КАК ДатаРаботыС,
	|		ДатаРаботыПо КАК ДатаРаботыПо,
	|		СтароеЗначение КАК СтароеЗначение,
	|		НовоеЗначение КАК НовоеЗначение,
	|		НаработкаСНачалаЭксплуатации КАК НаработкаСНачалаЭксплуатации,
	|		Наработка КАК Наработка,
	|		НаработкаСНачалаЭксплуатацииНачало КАК НаработкаСНачалаЭксплуатацииНачало,
	|		НаработкаОбъектов.Иерархия КАК Иерархия,
	|		РаспространятьНаПодчиненных КАК РаспространятьНаПодчиненных
	|	) КАК НаработкаОбъектов
	|ИЗ
	|	Документ.торо_УчетНаработкиОборудования КАК торо_УчетНаработкиОборудования
	|ГДЕ
	|	торо_УчетНаработкиОборудования.Ссылка В(&Ссылка)";
	
	ЗапросШапки.УстановитьПараметр("Ссылка", МассивОбъектов);
	ВыборкаШапки = ЗапросШапки.Выполнить().Выбрать();
	
	ЭтоПервый = Истина;
	
	Пока ВыборкаШапки.Следующий() Цикл	
		Если НЕ ЭтоПервый Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ЭтоПервый = Ложь;
		
		Шапка = Макет.ПолучитьОбласть("Шапка");
		СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
		Подвал = Макет.ПолучитьОбласть("Подвал");
		
		Шапка.Параметры.Заполнить(ВыборкаШапки);
		ТабДок.Вывести(Шапка);
		
		Ном = 1;
		НаработкаОбъектов = ВыборкаШапки.НаработкаОбъектов.Выгрузить();
		Для Каждого Строка Из НаработкаОбъектов Цикл
			СтрокаТаблицы.Параметры.Н = Ном;	
			СтрокаТаблицы.Параметры.Объект         = торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(Строка.Объект);	
			СтрокаТаблицы.Параметры.Показатель     = Строка.Показатель;	
			СтрокаТаблицы.Параметры.ЕдИзм          = Строка.Показатель.ЕдиницаИзмерения;	
			СтрокаТаблицы.Параметры.ИнвНомерОС     = Строка.Объект.ИнвентарныйНомер;	
			СтрокаТаблицы.Параметры.ТехНомерОС     = Строка.Объект.ТехНомер;	
			СтрокаТаблицы.Параметры.ДатаРаботыС    = Строка.ДатаРаботыС;	
			СтрокаТаблицы.Параметры.СтароеЗначение = Строка.СтароеЗначение;	
			СтрокаТаблицы.Параметры.Наработка      = Строка.Наработка;	
			СтрокаТаблицы.Параметры.ДатаРаботыПо   = Строка.ДатаРаботыПо;	
			СтрокаТаблицы.Параметры.НовоеЗначение  = Строка.НовоеЗначение;	
			ТабДок.Вывести(СтрокаТаблицы);
			Ном = Ном+1;
		КонецЦикла;
		
		Подвал.Параметры.Комментарий = ВыборкаШапки.Комментарий;
		Подвал.Параметры.Ответственный = ВыборкаШапки.Ответственный;
		
		ТабДок.Вывести(Подвал);
	КонецЦикла;
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	ТабДок.ТолькоПросмотр = Истина;
	Возврат ТабДок;
	
	
КонецФункции // ПечатьУчетПараметровНаработки()

#КонецОбласти

Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Истина;
	
КонецПроцедуры

Процедура ПриПолученииСлужебныхРеквизитов(Реквизиты) Экспорт
	
	Реквизиты.Добавить("ИзМобильного");
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
